{"id":16455,"date":"2024-11-08T09:03:03","date_gmt":"2024-11-08T09:03:03","guid":{"rendered":"https:\/\/www.artificialintelligence-news.com\/?p=16455"},"modified":"2024-11-08T09:03:08","modified_gmt":"2024-11-08T09:03:08","slug":"centralised-ai-is-dangerous-how-can-we-stop-it","status":"publish","type":"post","link":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/","title":{"rendered":"Centralised AI is dangerous: how can we stop it?"},"content":{"rendered":"\n<p>The intelligence displayed by generative AI chatbots like OpenAI&#8217;s ChatGPT has captured the imagination of individuals and corporations, and artificial intelligence has suddenly become the most exciting area of technology innovation.<\/p>\n\n\n\n<p>AI has been recognised as a game changer, with potential to transform many aspects of our lives. From personalised medicine to autonomous vehicles, automated investments to digital assets, the possibilities enabled by AI seem endless.<\/p>\n\n\n\n<p>But as transformational as AI will be, there are a lot of risks posed by this new technology. While fears about a malicious, Skynet-style AI system going rogue are misplaced, the dangers of AI centralisation are not. As companies like Microsoft, Google and Nvidia forge ahead in their pursuit of AI, fears about the concentration of power in the hands of just a few centralised players are becoming more pronounced.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Why should we worry about decentralised AI?<\/strong><\/h2>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Monopoly power<\/strong><\/h3>\n\n\n\n<p>The most pressing issue arising from centralised AI is the prospect of a few tech giants achieving<a href=\"https:\/\/www.politico.com\/newsletters\/digital-future-daily\/2024\/01\/18\/the-looming-ai-monopolies-00136400\"> monopolistic control<\/a> over the industry. The big tech giants have already accumulated a very significant market share in AI, giving them possession of vast amounts of data. They also control the infrastructure that AI systems run on, enabling them to stifle their competitors, hobble innovation, and perpetuate economic inequality.<\/p>\n\n\n\n<p>By achieving a monopoly over the development of AI, these companies are more likely to have an unfair influence on regulatory frameworks, which they can manipulate to their advantage. It will mean that smaller startups, which lack the enormous resources of big tech giants, will struggle to keep up with the pace of innovation. Those that do survive and look like they might thrive will almost certainly end up being acquired, further concentrating power in the hands of the few. The result will be less diversity in terms of AI development, fewer choices for consumers, and less favourable terms, limiting the use-cases and economic opportunities promised by AI.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Bias and Discrimination<\/strong><\/h3>\n\n\n\n<p>Aside from monopolistic control, there are genuine fears around the<a href=\"https:\/\/www.ohchr.org\/en\/stories\/2024\/07\/racism-and-ai-bias-past-leads-bias-future\"> bias of AI systems<\/a>, and these concerns will take on more importance as society increasingly relies on AI.<\/p>\n\n\n\n<p>The risk stems from the fact that organisations are becoming more reliant on automated systems to make decisions in many areas. It&#8217;s not unusual for a company to employ AI algorithms to filter job applicants, for example, and the risk is that a biased system could unfairly exclude a subset of candidates based on their ethnicity, age or location. AI is also used by insurance companies to set policy rates, by financial services firms to determine if someone qualifies for a loan and the amount of interest they&#8217;ll need to pay, and by law enforcement to determine which areas are more likely to see higher crime. In all of these use-cases, the potential implications of biased AI systems are extremely worrying.<\/p>\n\n\n\n<p>Whether it&#8217;s law enforcement targeting minority communities, discriminatory lending practices or something else, centralised AI can potentially exacerbate social inequality and enable systemic discrimination.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Privacy and surveillance<\/strong><\/h3>\n\n\n\n<p>Another risk posed by centralised AI systems is the lack of privacy protections. When just a few big companies control the vast majority of data generated by AI, they gain the ability to carry out unprecedented surveillance on their users. The data accumulated by the most dominant AI platforms can be used to monitor, analyse and predict an individual&#8217;s behaviour with incredible accuracy, eroding privacy and increasing the potential for the information to be misused.<\/p>\n\n\n\n<p>It&#8217;s of particular concern in countries with authoritarian governments, where data can be weaponised to create more sophisticated tools for<a href=\"https:\/\/www.npr.org\/2023\/06\/13\/1181868277\/how-ai-is-revolutionising-how-governments-conduct-surveillance\"> monitoring citizens<\/a>. But even in democratic societies, there is a threat posed by increased surveillance, as exemplified by the revelations of Edward Snowden about the US National Security Agency&#8217;s Prism program.<\/p>\n\n\n\n<p>Corporations can also potentially misuse consumer&#8217;s data to increase their profits. In addition, when centralised entities accumulate vast amounts of sensitive data, this makes them more lucrative targets for hackers, increasing the risk of data leaks.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Security risks<\/strong><\/h3>\n\n\n\n<p>Issues of national security can also arise due to centralised AI. For instance, there are justified fears that AI systems can be<a href=\"https:\/\/www.nature.com\/articles\/d41586-024-01029-0\"> weaponised<\/a> by nations, used to conduct cyberwarfare, engage in espionage, and develop new weapons systems. AI could become a key tool in future wars, raising the stakes in geopolitical conflicts.<\/p>\n\n\n\n<p>AI systems themselves can also be targeted. As nations increase their reliance on AI, such systems will make for enticing targets, as they are obvious single points of failure. Take out an AI system and you could disrupt the entire traffic flow of cities, take down electrical grids, and more.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Ethics<\/strong><\/h3>\n\n\n\n<p>The other major concern of centralised AI is about<a href=\"https:\/\/online.hbs.edu\/blog\/post\/ethical-considerations-of-ai\"> ethics<\/a>. That&#8217;s because the handful of companies that control AI systems would gain substantial influence over a society&#8217;s cultural norms and values, and might often prioritise profit, creating further ethical concerns.<\/p>\n\n\n\n<p>For example, AI algorithms are already being used widely by social media platforms to moderate content, in an attempt to identify and filter out offensive posts. The worry is that algorithms, either by accident or design, might end up suppressing free speech.&nbsp;<\/p>\n\n\n\n<p>There is already controversy about the effectiveness of AI-powered moderation systems, with numerous seemingly innocuous posts being blocked or taken down by automated algorithms. This leads to speculation that such systems are not broken but being manipulated behind the scenes based on the political narrative the platform is trying to promote.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>The alternative? Decentralised AI<\/strong><\/h2>\n\n\n\n<p>The only logical counterweight to centralised AI is the development of decentralised AI systems that ensure that control of the technology remains in the hands of the majority, rather than the few. By doing this, we can ensure that no single company or entity gains a significant influence over the direction of AI&#8217;s development.<\/p>\n\n\n\n<p>When the development and governance of AI is shared by thousands or millions of entities, its progress will be more equitable, with greater alignment to the needs of the individual. The result will be more diverse AI applications, with an almost endless selection of models used by different systems, instead of a few models that dominate the industry.<\/p>\n\n\n\n<p>Decentralised AI systems will also mean checks and balances against the risk of mass surveillance and manipulation of data. Whereas centralised AI can be weaponised and used in a way that&#8217;s contrary to the interests of the many, decentralised AI hedges against this kind of oppression.<\/p>\n\n\n\n<p>The main advantage of decentralised AI is that everyone is in control over the technology&#8217;s evolution, preventing any single entity from gaining an outsized influence over its development.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to decentralise AI<\/strong><\/h2>\n\n\n\n<p>Decentralised AI involves a rethink of the layers that make up the AI technology stack, including elements like the infrastructure (compute and networking resources), the data, models, training, inference, and fine-tuning processes.<\/p>\n\n\n\n<p>We can&#8217;t just put our hopes in open-source models if the underlying infrastructure remains fully centralised by cloud computing giants like Amazon, Microsoft and Google, for instance. We need to ensure that every aspect of AI is decentralised<\/p>\n\n\n\n<p>The best way to decentralise the AI stack is to break it down into modular components and create markets around them based on supply and demand. One such example of how this can work is<a href=\"https:\/\/www.spheron.network\/\"> Spheron<\/a>, which has created a Decentralised Physical Infrastructure Network (DePIN) that anyone can participate in.<\/p>\n\n\n\n<p>With Spheron&#8217;s DePIN, everyone is free to share their underutilised computing resources, essentially renting them out to those who need infrastructure to host their AI applications. So, a graphic designer who uses a powerful laptop with a GPU can donate processing power to the DePIN when they&#8217;re not using it for their own work, and be rewarded with token incentives.<\/p>\n\n\n\n<p>What this means is that the AI infrastructure layer becomes widely distributed and decentralised, with no single provider in control. It&#8217;s enabled by blockchain technology and smart contracts, which provide transparency, immutability and automation.<\/p>\n\n\n\n<p>DePIN can also work for open-source models and underlying data. For instance, it&#8217;s possible to share training datasets on a decentralised network like<a href=\"https:\/\/qubic.org\/\"> Qubic<\/a>, which will make sure the provider of that data is rewarded each time their information is accessed by an AI system.<\/p>\n\n\n\n<p>To ensure access and permissions are decentralised, every part of the technology stack is distributed in this way. However, the AI industry currently struggles to provide such a level of decentralisation. Although open-source models have become extremely popular among AI developers, most people continue to rely on proprietary cloud networks, meaning the training and inference processes are heavily centralised.<\/p>\n\n\n\n<p>But there are strong incentives for decentralisation to win out. One of the primary advantages of DePIN networks, for example, is that they help to reduce overheads. Because networks like Spheron don&#8217;t rely on intermediaires, participants don&#8217;t need to make any payments or share revenue with third-parties. Moreover, they can afford to be more competitive in terms of pricing than corporations that are under pressure to grow profitability.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Decentralisation must win<\/strong><\/h2>\n\n\n\n<p>The future of AI holds a lot of potential, but it&#8217;s also perilous. While the capabilities of AI systems have improved dramatically in the last few years, most of the advances have been made by all-powerful companies and that has resulted in an increase in their influence over the industry. There&#8217;s a price to pay for this, not just in monetary terms.<\/p>\n\n\n\n<p>The only reasonable alternative is to promote the greater adoption of decentralised AI, which can enhance accessibility and ensure a greater flexibility of AI. By allowing everyone to participate in the development of AI on an equal footing, we&#8217;ll see more diverse, interesting, and useful applications that can benefit everyone equally, as well as putting their users first.<\/p>\n\n\n\n<p>Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The intelligence displayed by generative AI chatbots like OpenAI&#8217;s ChatGPT has captured the imagination of individuals and corporations, and artificial intelligence has suddenly become the most exciting area of technology innovation. AI has been recognised as a game changer, with potential to transform many aspects of our lives. From personalised medicine to autonomous vehicles, automated<a class=\"excerpt-read-more\" href=\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\" title=\"ReadCentralised AI is dangerous: how can we stop it?\">&#8230; Read more &raquo;<\/a><\/p>\n","protected":false},"author":58280,"featured_media":16456,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_acf_changed":false,"om_disable_all_campaigns":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"_uf_show_specific_survey":0,"_uf_disable_surveys":false,"footnotes":""},"categories":[303],"tags":[],"ppma_author":[3057],"class_list":["post-16455","post","type-post","status-publish","format-standard","has-post-thumbnail","hentry","category-ai-ethics-society"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Centralised AI is dangerous: how can we stop it? - AI News<\/title>\n<meta name=\"description\" content=\"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Centralised AI is dangerous: how can we stop it? - AI News\" \/>\n<meta property=\"og:description\" content=\"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\" \/>\n<meta property=\"og:site_name\" content=\"AI News\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AITechNews\/\" \/>\n<meta property=\"article:published_time\" content=\"2024-11-08T09:03:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-11-08T09:03:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"720\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"AI News\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@ai_technews\" \/>\n<meta name=\"twitter:site\" content=\"@ai_technews\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"David\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#article\",\"isPartOf\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\"},\"author\":{\"name\":\"David\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/b3e720ba682b06d5f3e3a80854c214e5\"},\"headline\":\"Centralised AI is dangerous: how can we stop it?\",\"datePublished\":\"2024-11-08T09:03:03+00:00\",\"dateModified\":\"2024-11-08T09:03:08+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\"},\"wordCount\":1651,\"commentCount\":0,\"publisher\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#organization\"},\"image\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png\",\"articleSection\":[\"Ethics &amp; Society\"],\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"CommentAction\",\"name\":\"Comment\",\"target\":[\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#respond\"]}]},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\",\"url\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\",\"name\":\"Centralised AI is dangerous: how can we stop it? - AI News\",\"isPartOf\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage\"},\"image\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage\"},\"thumbnailUrl\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png\",\"datePublished\":\"2024-11-08T09:03:03+00:00\",\"dateModified\":\"2024-11-08T09:03:08+00:00\",\"description\":\"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/\"]}]},{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage\",\"url\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png\",\"contentUrl\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png\",\"width\":1200,\"height\":720},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.artificialintelligence-news.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Centralised AI is dangerous: how can we stop it?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#website\",\"url\":\"https:\/\/www.ianj52.sg-host.com\/\",\"name\":\"AI News\",\"description\":\"Artificial Intelligence News\",\"publisher\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.ianj52.sg-host.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#organization\",\"name\":\"AI News\",\"url\":\"https:\/\/www.ianj52.sg-host.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png\",\"contentUrl\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png\",\"width\":400,\"height\":78,\"caption\":\"AI News\"},\"image\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AITechNews\/\",\"https:\/\/x.com\/ai_technews\",\"https:\/\/www.linkedin.com\/groups\/1906826\/\"]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/b3e720ba682b06d5f3e3a80854c214e5\",\"name\":\"David\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/image\/887dd9459c8d6c06bc68f858fcf2441f\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/8e0d8b98a80e4a866265f1b557d70289?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/8e0d8b98a80e4a866265f1b557d70289?s=96&d=mm&r=g\",\"caption\":\"David\"},\"url\":\"https:\/\/www.artificialintelligence-news.com\/news\/author\/davidcropley\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Centralised AI is dangerous: how can we stop it? - AI News","description":"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/","og_locale":"en_GB","og_type":"article","og_title":"Centralised AI is dangerous: how can we stop it? - AI News","og_description":"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.","og_url":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/","og_site_name":"AI News","article_publisher":"https:\/\/www.facebook.com\/AITechNews\/","article_published_time":"2024-11-08T09:03:03+00:00","article_modified_time":"2024-11-08T09:03:08+00:00","og_image":[{"width":1200,"height":720,"url":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png","type":"image\/png"}],"author":"AI News","twitter_card":"summary_large_image","twitter_creator":"@ai_technews","twitter_site":"@ai_technews","twitter_misc":{"Written by":"David","Estimated reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#article","isPartOf":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/"},"author":{"name":"David","@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/b3e720ba682b06d5f3e3a80854c214e5"},"headline":"Centralised AI is dangerous: how can we stop it?","datePublished":"2024-11-08T09:03:03+00:00","dateModified":"2024-11-08T09:03:08+00:00","mainEntityOfPage":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/"},"wordCount":1651,"commentCount":0,"publisher":{"@id":"https:\/\/www.ianj52.sg-host.com\/#organization"},"image":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage"},"thumbnailUrl":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png","articleSection":["Ethics &amp; Society"],"inLanguage":"en-GB","potentialAction":[{"@type":"CommentAction","name":"Comment","target":["https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#respond"]}]},{"@type":"WebPage","@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/","url":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/","name":"Centralised AI is dangerous: how can we stop it? - AI News","isPartOf":{"@id":"https:\/\/www.ianj52.sg-host.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage"},"image":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage"},"thumbnailUrl":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png","datePublished":"2024-11-08T09:03:03+00:00","dateModified":"2024-11-08T09:03:08+00:00","description":"Building a decentralised AI future will involve a great deal of coordination and collaboration across every layer of the AI stack. Fortunately, there are strong incentives for participants to do just that. And again, the incentives are not just monetary.","breadcrumb":{"@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/"]}]},{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#primaryimage","url":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png","contentUrl":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/11\/marketacross.png","width":1200,"height":720},{"@type":"BreadcrumbList","@id":"https:\/\/www.artificialintelligence-news.com\/news\/centralised-ai-is-dangerous-how-can-we-stop-it\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.artificialintelligence-news.com\/"},{"@type":"ListItem","position":2,"name":"Centralised AI is dangerous: how can we stop it?"}]},{"@type":"WebSite","@id":"https:\/\/www.ianj52.sg-host.com\/#website","url":"https:\/\/www.ianj52.sg-host.com\/","name":"AI News","description":"Artificial Intelligence News","publisher":{"@id":"https:\/\/www.ianj52.sg-host.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.ianj52.sg-host.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.ianj52.sg-host.com\/#organization","name":"AI News","url":"https:\/\/www.ianj52.sg-host.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png","contentUrl":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png","width":400,"height":78,"caption":"AI News"},"image":{"@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AITechNews\/","https:\/\/x.com\/ai_technews","https:\/\/www.linkedin.com\/groups\/1906826\/"]},{"@type":"Person","@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/b3e720ba682b06d5f3e3a80854c214e5","name":"David","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/person\/image\/887dd9459c8d6c06bc68f858fcf2441f","url":"https:\/\/secure.gravatar.com\/avatar\/8e0d8b98a80e4a866265f1b557d70289?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/8e0d8b98a80e4a866265f1b557d70289?s=96&d=mm&r=g","caption":"David"},"url":"https:\/\/www.artificialintelligence-news.com\/news\/author\/davidcropley\/"}]}},"authors":[{"term_id":3057,"user_id":0,"is_guest":1,"slug":"ai-news","display_name":"AI News","avatar_url":{"url":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/08\/ai-news.png","url2x":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2024\/08\/ai-news.png"},"user_url":"","last_name":"","first_name":"","job_title":"","description":""}],"_links":{"self":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/posts\/16455","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/users\/58280"}],"replies":[{"embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/comments?post=16455"}],"version-history":[{"count":0,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/posts\/16455\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/media\/16456"}],"wp:attachment":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/media?parent=16455"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/categories?post=16455"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/tags?post=16455"},{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/ppma_author?post=16455"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}