{"id":9293,"date":"2020-02-04T09:06:32","date_gmt":"2020-02-04T09:06:32","guid":{"rendered":"http:\/\/marketingtechnews.sites.techforge.v1\/?page_id=9293"},"modified":"2024-07-18T09:46:37","modified_gmt":"2024-07-18T09:46:37","slug":"privacy-policy","status":"publish","type":"page","link":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/","title":{"rendered":"Privacy Policy"},"content":{"rendered":"\n<h1 class=\"wp-block-heading\"><strong>About this policy<\/strong><\/h1>\n\n\n\n<p>This policy explains how we collect and use personal data from and about visitors and subscribers to our website, event attendees, speakers, exhibitors and sponsors and the press and media.<\/p>\n\n\n\n<p>Our objective is to ensure that you are never surprised by how your personal data has been used by us. You are therefore encouraged to read this policy, which sits alongside our&nbsp;<a href=\"https:\/\/techforge.pub\/terms-conditions\/\">Terms &amp; Conditions.<\/a><\/p>\n\n\n\n<p>As we make changes to our website, we may need to update this policy. If we make any important changes that affect your rights and interests, we will make sure we bring this to your attention and explain what this means for you.<\/p>\n\n\n\n<p>If you have any questions in relation to this policy or wish to exercise any of Your rights under data protection law, you should email &nbsp;<a href=\"mailto:query@techforge.pub\">query@techforge.pub<\/a>&nbsp;&nbsp;[or call us on 0117 980 9020].<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Who we are<\/strong><\/h3>\n\n\n\n<p>This website and the TechForge Media news publications portfolio and brand are owned and operated by TechForge Media Ltd. (<strong>we<\/strong>\/<strong>us<\/strong>). We are a private limited company registered in England and Wales under company number 09194965 [We are registered as a data controller with the UK Information Commissioner’s Office under number ZA377147. We are registered at Armada House, Telephone Avenue, City Centre, Bristol, BS1 4BQ.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>The data we collect about you<\/strong><\/h3>\n\n\n\n<p>Personal data means any data that identifies or can be used to identify a person. It does not include data where the identity has been removed (anonymous data).<\/p>\n\n\n\n<p>The types of personal we collect from or about you depends on which group you fall into. Personal information may include, email address, postal address, name, payment information, mobile or landline telephone numbers as well as other personal information you may provide to us.<\/p>\n\n\n\n<p>Unless you specifically inform us (or it may be inferred, for example, from your dietary preferences or access requirements), we do not collect any details about your race or ethnicity, religious or philosophical beliefs, sex life, sexual orientation, political opinions, trade union membership, information about your health and genetic and biometric data. Nor do we collect any information about criminal convictions and offences.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How your data is collected<\/strong><\/h3>\n\n\n\n<p>The data that you may provide to us will generally be collected when you complete and submit forms on our website or contact us or register for our events.<\/p>\n\n\n\n<p>The data that we may collect about you may be obtained:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>through the use of cookies and similar technologies (such as beacons and pixels) and server logs (see our <a href=\"https:\/\/www.cloudcomputing-news.net\/cookie-policy-uk\/\">Cookies Policy<\/a>)<\/li>\n\n\n\n<li>from third party analytics providers such as Google Analytics<\/li>\n\n\n\n<li>Submission of a form on our websites<\/li>\n\n\n\n<li>by registering to attend any of our events<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"what-personal-data-we-collect-and-why-we-collect-it\">What Personal Data We Collect and Why We Collect It<\/h3>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"comments\">Comments<\/h4>\n\n\n\n<p>When visitors leave comments on the site we collect the data shown in the comments form, and also the visitor’s IP address and browser user agent string to help spam detection.<\/p>\n\n\n\n<p>An anonymized string created from your email address (also called a hash) may be provided to the Gravatar service to see if you are using it. The Gravatar service privacy policy is available here: https:\/\/automattic.com\/privacy\/. After approval of your comment, your profile picture is visible to the public in the context of your comment.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"media\">Media<\/h4>\n\n\n\n<p>If you upload images to the website, you should avoid uploading images with embedded location data (EXIF GPS) included. Visitors to the website can download and extract any location data from images on the website.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\" id=\"cookies\">Cookies<\/h4>\n\n\n\n<p>If you leave a comment on our site you may opt-in to saving your name, email address and website in cookies. These are for your convenience so that you do not have to fill in your details again when you leave another comment. These cookies will last for one year.<\/p>\n\n\n\n<p>If you visit our login page, we will set a temporary cookie to determine if your browser accepts cookies. This cookie contains no personal data and is discarded when you close your browser.<\/p>\n\n\n\n<p>When you log in, we will also set up several cookies to save your login information and your screen display choices. Login cookies last for two days, and screen options cookies last for a year. If you select “Remember Me”, your login will persist for two weeks. If you log out of your account, the login cookies will be removed.<\/p>\n\n\n\n<p>If you edit or publish an article, an additional cookie will be saved in your browser. This cookie includes no personal data and simply indicates the post ID of the article you just edited. It expires after 1 day.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"embedded-content-from-other-websites\">Embedded Content From Other Websites<\/h3>\n\n\n\n<p>Articles on this site may include embedded content (e.g. videos, images, articles, etc.). Embedded content from other websites behaves in the exact same way as if the visitor has visited the other website.<\/p>\n\n\n\n<p>These websites may collect data about you, use cookies, embed additional third-party tracking, and monitor your interaction with that embedded content, including tracking your interaction with the embedded content if you have an account and are logged in to that website.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How we use your data<\/strong><\/h3>\n\n\n\n<p>By completing and submitting a form on this website, registering for our event or subscribing you are consenting to your contact data being shared with third parties who may contact you with products and services that may be of interest to you. You reserve the right to have your contact data not be shared by contacting the team on&nbsp;<a href=\"https:\/\/www.cloudcomputing-news.net\/privacy-policy\/query@techforge.pub\">querytechforge.pub<\/a><\/p>\n\n\n\n<p>We will only use your personal data when the law allows us to. We will generally rely on one of three legal grounds for using your personal data:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>where we need to perform the contract we are about to enter into or have entered into with you (see our Terms &amp; Conditions)<\/li>\n\n\n\n<li>where necessary for our legitimate interests or those of a third party, provided those interests do not override your fundamental rights and interests<\/li>\n\n\n\n<li>where we need to comply with a legal or regulatory obligation<\/li>\n<\/ul>\n\n\n\n<p>Generally, we do not rely on consent as a legal ground for using your personal data, except in relation to sending you marketing by email or text message. You have the right to withdraw your consent to marketing at any time either by contacting us, clicking the unsubscribe link in an email or replying to a text message with the required words notified to you in each text message.<\/p>\n\n\n\n<p>By registering for an event you are consenting to your contact data to be shared with third parties (event sponsors).<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"who-we-share-your-data-with\">Who We Share Your Data With<\/h3>\n\n\n\n<p>We may share your personal data :<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>with service providers including our hosting provider, email marketing platform provider, online survey provider, analytics providers, lead generation providers<\/li>\n\n\n\n<li>with HM Revenue &amp; Customs, the tax authority in the UK who require reporting of our processing activities in certain circumstances<\/li>\n\n\n\n<li>any third parties to whom we may choose to sell, transfer or merge parts of our business or assets or third parties we may seek to acquire or merge with (if any change happens to our business, the new owners may use your personal data in the same way as set out in this policy)<\/li>\n\n\n\n<li>with carefully selected third parties who’s products and service may interest you<\/li>\n<\/ul>\n\n\n\n<p>By registering for any event, or submitting any form on our website you are consenting to your contact data being shared with third parties who may contact you with products and services that may be of interest to you. You reserve the right to have your contact data not be shared by contacting the event team on&nbsp;<a href=\"mailto:query@techforge.pub\">query@techforge.pub<\/a><\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"how-long-we-retain-your-data\">How Long We Retain Your Data<\/h3>\n\n\n\n<p>If you leave a comment, the comment and its metadata are retained indefinitely. This is so we can recognize and approve any follow-up comments automatically instead of holding them in a moderation queue.<\/p>\n\n\n\n<p>For users that register on our website (if any), we also store the personal information they provide in their user profile. All users can see, edit, or delete their personal information at any time (except they cannot change their username). Website administrators can also see and edit that information.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"what-rights-you-have-over-your-data\">What Rights You Have Over Your Data<\/h3>\n\n\n\n<p>If you have an account on this site, or have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"where-we-send-your-data\">Where We Send Your Data<\/h3>\n\n\n\n<p>Visitor comments may be checked through an automated spam detection service<a href=\"https:\/\/techforge.pub\/wp-admin\/post.php?post=3&amp;action=edit\">.<\/a><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Where your data is stored<\/strong><\/h3>\n\n\n\n<p>Many of the service providers that we use in connection with our website and the services provided through it are based outside the European Economic Area (<strong>EEA<\/strong>), which means that certain personal data will be transferred outside the EEA. Whenever we transfer your personal data outside the EEA, we ensure that a similar degree of protection applies to your personal data in one or more of the following ways:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>the country to which your personal data is transferred is deemed by the European Commission to provide a similar degree of protection for your personal data<\/li>\n\n\n\n<li>we have entered into a specific contract with our service providers that has been approved by the European Commission as providing a similar degree of protection for your personal data<\/li>\n\n\n\n<li>where any service provider is based in the US and they have self-certified under the <a href=\"https:\/\/www.privacyshield.gov\/\">EU-US Privacy Shield Framework<\/a> which requires them to provide a similar degree of protection for your personal data<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"what-rights-you-have-over-your-data\">What Rights You Have Over Your Data<\/h3>\n\n\n\n<p>If you have an account on this site, or have left comments, you can request to receive an exported file of the personal data we hold about you, including any data you have provided to us. You can also request that we erase any personal data we hold about you. This does not include any data we are obliged to keep for administrative, legal, or security purposes.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"where-we-send-your-data\">Where We Send Your Data<\/h3>\n\n\n\n<p>Visitor comments may be checked through an automated spam detection service<a href=\"https:\/\/techforge.pub\/wp-admin\/post.php?post=3&amp;action=edit\">.<\/a><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How we keep your data secure<\/strong><\/h3>\n\n\n\n<p>We have put in place appropriate security measures (for example, access to our website is secured using ‘https’ technology and access to payment card details is encrypted) to prevent your personal data from being accidentally lost, used or accessed in an unauthorised way, altered or disclosed. We also limit access to your personal data to those within our organisation that have a need to access it. They will only process your personal data on our instructions and they are required to keep your personal data confidential.<\/p>\n\n\n\n<p><em>We collect your public profile data only from your consent that you grant before initiating Social Login, from the social network used to login at our website. This data includes your first name, last name, email address, link to your social media profile, unique identifier, link to social profile avatar. This data is used to create your user profile at our website. You can revoke this consent at any time by sending us an email.<\/em><\/p>\n\n\n\n<p><em>We use Google Analytics to track social shares made at our website. Google automatically collect and store certain information in their server logs which includes device event information such as crashes, system activity, hardware settings, browser type, browser language, the date and time of your request and referral URL, cookies that may uniquely identify your browser or your Google Account, in accordance with their data privacy policy: https:\/\/policies.google.com\/privacy<\/em><\/p>\n\n\n\n<p><em>We embed a Facebook widget to allow you to see number of likes\/shares\/recommends and “like\/share\/recommend” our webpages. This widget may collect your IP address, your web browser User Agent, store and retrieve cookies on your browser, embed additional tracking, and monitor your interaction with the widget, including correlating your Facebook account with whatever action you take within the widget (such as “liking\/sharing\/recommending” our webpage), if you are logged in to Facebook. For more information about how this data may be used, please see Facebook’s data privacy policy: https:\/\/www.facebook.com\/about\/privacy\/update<\/em><\/p>\n\n\n\n<p><em>We use a Twitter Tweet widget at our website. As a result, our website makes requests to Twitter’s servers for you to be able to tweet our webpages using your Twitter account. These requests make your IP address visible to Twitter, who may use it in accordance with their data privacy policy: https:\/\/twitter.com\/en\/privacy#update<\/em><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>How long we keep your data for<\/strong><\/h3>\n\n\n\n<p>We will only keep your personal data for as long as necessary in connection with the purposes we collected it for and to comply with any legal, accounting or reporting requirements. To determine how long we keep your personal data for, we consider the amount, nature and sensitivity of the personal data, the purposes for which it was collected and the potential risk of harm from us continuing to keep it.<\/p>\n\n\n\n<p>We will retain personal data relating to email marketing data (see Marketing) until you unsubscribe or your email address has become permanently unavailable.<\/p>\n\n\n\n<p>We will retain the analytical data collected about your use of our website for a period of 25 months before 25 May 2018 and [14] months on and after 25 May 2018.<\/p>\n\n\n\n<p>We may retain any data that does not identify you indefinitely.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Email marketing<\/strong><\/h3>\n\n\n\n<p>Our email marketing campaigns can track whether you click any of the links contained in our emails. This helps us to understand what the recipients of our emails have found interesting and to personalise the content of emails that we may send to you in the future.<\/p>\n\n\n\n<p>We use tiny invisible images called ‘pixels’ that are contained within emails to enable us to see:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>whether you opened an email<\/li>\n\n\n\n<li>where in the world the device used to open the email was located (based on your device’s IP address)<\/li>\n\n\n\n<li>the type of email client used to open the email<\/li>\n\n\n\n<li>whether you shared the email on any social media platforms<\/li>\n\n\n\n<li>whether you marked the email as spam<\/li>\n\n\n\n<li>your overall level of engagement with our email marketing campaigns.<\/li>\n<\/ul>\n\n\n\n<p>We use this data to improve the format and quality of our email marketing campaigns.<\/p>\n\n\n\n<p>You have the right to withdraw your consent to marketing at any time either by contacting us or clicking the unsubscribe link in any email.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\" id=\"security\">Security<\/h3>\n\n\n\n<p>We take precautions to safeguard your personal information against loss, theft and misuse and unauthorised access, disclosure, alteration and destruction through the use of appropriate technical and organisational measures. Certain areas of our websites may be password protected. If you are a user of our websites and have a password, you can help to preserve your privacy by ensuring that you do not share your password with anyone else.<\/p>\n\n\n\n<p>We take steps to regularly validate the personal information we hold to ensure that the information is accurate and, where necessary, up to date. Information that is no longer required for any valid business purpose, and that we are not required to keep pursuant to any applicable law, will be routinely destroyed by secure means.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Your rights<\/strong><\/h3>\n\n\n\n<p>You have a number of rights in relation to the personal data we hold about you:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Access: You have the <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-of-access\/\">right to request access<\/a> to and be provided with a copy of the personal data held about you together with certain information about the processing of such personal data to check that are holding it lawfully<\/li>\n\n\n\n<li>Correction: You have the <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-to-rectification\/\">right to ask us to correct<\/a> any inaccurate or incomplete personal data held about you<\/li>\n\n\n\n<li>Deletion: You have the <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-to-erasure\/\">right to ask us to delete or remove<\/a> any personal data held about you where there is no good reason for us to continue holding it or where you have exercised your right to object<\/li>\n\n\n\n<li>Restriction: You have the <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-to-restrict-processing\/\">right to ask us to restrict<\/a> how we hold your personal data, for example, to confirm its accuracy or our reasons for holding it<\/li>\n\n\n\n<li>Objection: You have the <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-to-object\/\">right to object<\/a> to our holding of any personal data about you which is based on our legitimate interests or those of a third party based on your particular circumstances. You also have the right to object to our holding your personal data for direct marketing purposes<\/li>\n\n\n\n<li>Portability: You have the right to receive or <a href=\"https:\/\/ico.org.uk\/for-organisations\/guide-to-the-general-data-protection-regulation-gdpr\/individual-rights\/right-to-data-portability\/\">request that we transfer<\/a> a copy of the personal data we hold about you in an electronic format where the basis of our holding such information is your consent or the performance of a contract and the information is processed by automated means<\/li>\n\n\n\n<li>Complaints: You have the right to complain to the <a href=\"https:\/\/ico.org.uk\/concerns\/\">Information Commissioner’s Office (ICO)<\/a> or any other <a href=\"http:\/\/ec.europa.eu\/justice\/article-29\/structure\/data-protection-authorities\/index_en.htm\">EU supervisory authority<\/a> in relation to how we collect and use your personal data<\/li>\n<\/ul>\n\n\n\n<p>You will not have to pay any fee to exercise any of the above rights though we may charge a reasonable fee or refuse to comply with your request if any request is clearly unfounded or excessive. Where this is the case, we will let you know.<\/p>\n\n\n\n<p>To protect the confidentiality of your personal data we may ask you to verify your identity before fulfilling any request in relation to your personal data.<\/p>\n\n\n\n<p>If you have any questions about this policy or your personal information, please contact us by emailing&nbsp;<a href=\"mailto:query@techforge.pub\">query@techforge.pub<\/a>&nbsp;or by writing to TechForge Media Marketing Manager, Armada House, Telephone Avenue, City Centre, Bristol, BS1 4BQ, or by calling&nbsp; + 44 1179 980 9020.<\/p>\n\n\n\n<p>We are constantly looking for new ways to improve this website and consequently we may amend this privacy and cookie policy from time to time.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>About this policy This policy explains how we collect and use personal data from and about visitors and subscribers to our website, event attendees, speakers, exhibitors and sponsors and the press and media. Our objective is to ensure that you are never surprised by how your personal data has been used by us. You are<a class=\"excerpt-read-more\" href=\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\" title=\"ReadPrivacy Policy\">&#8230; Read more &raquo;<\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_acf_changed":false,"om_disable_all_campaigns":false,"_monsterinsights_skip_tracking":false,"_monsterinsights_sitenote_active":false,"_monsterinsights_sitenote_note":"","_monsterinsights_sitenote_category":0,"_uf_show_specific_survey":0,"_uf_disable_surveys":false,"footnotes":""},"ppma_author":[2405],"class_list":["post-9293","page","type-page","status-publish","hentry"],"acf":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Privacy Policy - AI News<\/title>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Privacy Policy - AI News\" \/>\n<meta property=\"og:description\" content=\"About this policy This policy explains how we collect and use personal data from and about visitors and subscribers to our website, event attendees, speakers, exhibitors and sponsors and the press and media. Our objective is to ensure that you are never surprised by how your personal data has been used by us. You are... Read more &raquo;\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\" \/>\n<meta property=\"og:site_name\" content=\"AI News\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/AITechNews\/\" \/>\n<meta property=\"article:modified_time\" content=\"2024-07-18T09:46:37+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@ai_technews\" \/>\n<meta name=\"twitter:label1\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\",\"url\":\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\",\"name\":\"Privacy Policy - AI News\",\"isPartOf\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#website\"},\"datePublished\":\"2020-02-04T09:06:32+00:00\",\"dateModified\":\"2024-07-18T09:46:37+00:00\",\"breadcrumb\":{\"@id\":\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.artificialintelligence-news.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Privacy Policy\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#website\",\"url\":\"https:\/\/www.ianj52.sg-host.com\/\",\"name\":\"AI News\",\"description\":\"Artificial Intelligence News\",\"publisher\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.ianj52.sg-host.com\/?s={search_term_string}\"},\"query-input\":{\"@type\":\"PropertyValueSpecification\",\"valueRequired\":true,\"valueName\":\"search_term_string\"}}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#organization\",\"name\":\"AI News\",\"url\":\"https:\/\/www.ianj52.sg-host.com\/\",\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png\",\"contentUrl\":\"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png\",\"width\":400,\"height\":78,\"caption\":\"AI News\"},\"image\":{\"@id\":\"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/\"},\"sameAs\":[\"https:\/\/www.facebook.com\/AITechNews\/\",\"https:\/\/x.com\/ai_technews\",\"https:\/\/www.linkedin.com\/groups\/1906826\/\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Privacy Policy - AI News","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/","og_locale":"en_GB","og_type":"article","og_title":"Privacy Policy - AI News","og_description":"About this policy This policy explains how we collect and use personal data from and about visitors and subscribers to our website, event attendees, speakers, exhibitors and sponsors and the press and media. Our objective is to ensure that you are never surprised by how your personal data has been used by us. You are... Read more &raquo;","og_url":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/","og_site_name":"AI News","article_publisher":"https:\/\/www.facebook.com\/AITechNews\/","article_modified_time":"2024-07-18T09:46:37+00:00","twitter_card":"summary_large_image","twitter_site":"@ai_technews","twitter_misc":{"Estimated reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/","url":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/","name":"Privacy Policy - AI News","isPartOf":{"@id":"https:\/\/www.ianj52.sg-host.com\/#website"},"datePublished":"2020-02-04T09:06:32+00:00","dateModified":"2024-07-18T09:46:37+00:00","breadcrumb":{"@id":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.artificialintelligence-news.com\/privacy-policy\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.artificialintelligence-news.com\/privacy-policy\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.artificialintelligence-news.com\/"},{"@type":"ListItem","position":2,"name":"Privacy Policy"}]},{"@type":"WebSite","@id":"https:\/\/www.ianj52.sg-host.com\/#website","url":"https:\/\/www.ianj52.sg-host.com\/","name":"AI News","description":"Artificial Intelligence News","publisher":{"@id":"https:\/\/www.ianj52.sg-host.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.ianj52.sg-host.com\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-GB"},{"@type":"Organization","@id":"https:\/\/www.ianj52.sg-host.com\/#organization","name":"AI News","url":"https:\/\/www.ianj52.sg-host.com\/","logo":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/","url":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png","contentUrl":"https:\/\/www.artificialintelligence-news.com\/wp-content\/uploads\/2020\/03\/ai-newsv4-2-svg.png","width":400,"height":78,"caption":"AI News"},"image":{"@id":"https:\/\/www.ianj52.sg-host.com\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/AITechNews\/","https:\/\/x.com\/ai_technews","https:\/\/www.linkedin.com\/groups\/1906826\/"]}]}},"_links":{"self":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/pages\/9293","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/comments?post=9293"}],"version-history":[{"count":0,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/pages\/9293\/revisions"}],"wp:attachment":[{"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/media?parent=9293"}],"wp:term":[{"taxonomy":"author","embeddable":true,"href":"https:\/\/www.artificialintelligence-news.com\/wp-json\/wp\/v2\/ppma_author?post=9293"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}